In [1]:
import pandas as pd
import numpy as np

In [4]:
d = {'cleanliness':['Clean','Average','Somewhat clean','Somewhat dirty','Dirty'],
     'safety':['Neutral','Very safe','Somewhat safe','Very unsafe','Somewhat unsafe'],
     'satisfaction':['Very satisfied','Neutral','Somewhat satisfied','Somewhat unsatisfied','Very unsatisfied']}

In [5]:
df = pd.DataFrame(d)
df

      cleanliness           safety          satisfaction
0           Clean          Neutral        Very satisfied
1         Average        Very safe               Neutral
2  Somewhat clean    Somewhat safe    Somewhat satisfied
3  Somewhat dirty      Very unsafe  Somewhat unsatisfied
4           Dirty  Somewhat unsafe      Very unsatisfied

In [6]:
df.to_csv('categories.csv', index=False)

In [3]:
d = {'Full name':['Noelani A. Gray','Myles Z. Gomez','Gil B. Silva','Prescott D. Hardin','Benedict G. Valdez',
                  'Reece M. Andrews','Hayfa E. Keith','Hedley I. Logan','Jack W. Carrillo','Lionel M. Davis'],
    'Phone number':['001-702-397-5143','001-329-485-0540','001-195-492-2338','+1-297-996-4904','001-969-820-3536','4138',
                    '001-536-175-8444','001-681-552-1823','001-910-323-5265','001-143-119-9210']}

In [4]:
df = pd.DataFrame(d)
df

            Full name      Phone number
0     Noelani A. Gray  001-702-397-5143
1      Myles Z. Gomez  001-329-485-0540
2        Gil B. Silva  001-195-492-2338
3  Prescott D. Hardin   +1-297-996-4904
4  Benedict G. Valdez  001-969-820-3536
5    Reece M. Andrews              4138
6      Hayfa E. Keith  001-536-175-8444
7     Hedley I. Logan  001-681-552-1823
8    Jack W. Carrillo  001-910-323-5265
9     Lionel M. Davis  001-143-119-9210

In [5]:
df.to_csv('phones.csv',index=False)

In [6]:
f = {'Full name':['Olga Robinson','Justina Kim','Tamekah Henson','Miranda Solis','Caldwell Gilliam'],
     'Phone number':['+(01706)-258911','+0500-5714372','+0800-11113','+07058-8790634','+(016977)-8424']}

In [8]:
df1 = pd.DataFrame(f)
df1

          Full name     Phone number
0     Olga Robinson  +(01706)-258911
1       Justina Kim    +0500-5714372
2    Tamekah Henson      +0800-11113
3     Miranda Solis   +07058-8790634
4  Caldwell Gilliam   +(016977)-8424

In [9]:
df1.to_csv('phones_1.csv',index=False)

In [2]:
d = {'Birthday':['27/27/19','03-29-19','March 3rd, 2019','24-03-19','06-03-19'],         
     'First name':['Rowan','Brynn','Sophia','Deacon','Griffith'],
     'Last name':['Nunez','Yang','Reilly','Prince','Neal']}

In [3]:
df = pd.DataFrame(d)
df

          Birthday First name Last name
0         27/27/19      Rowan     Nunez
1         03-29-19      Brynn      Yang
2  March 3rd, 2019     Sophia    Reilly
3         24-03-19     Deacon    Prince
4         06-03-19   Griffith      Neal

In [4]:
df.to_csv('birthdays.csv',index=False)

In [5]:
da = {'flight_number':['DL140','BA248','MEA124','AFR939','TKA101'],
      'economy_class':['100','130','100','140','130'],
      'business_class':['60','100','50','70','100'],
      'first_class':['40','70','50','90','20'],
      'total_passengers':['200','300','200','300','250']}

In [6]:
df1 = pd.DataFrame(da)
df1

  flight_number economy_class business_class first_class total_passengers
0         DL140           100             60          40              200
1         BA248           130            100          70              300
2        MEA124           100             50          50              200
3        AFR939           140             70          90              300
4        TKA101           130            100          20              250

In [7]:
df1.to_csv('flights.csv',index=False)

In [8]:
f = {'user_id':['32985','94387','34236','12551','55212'],
     'Age':['22','27','42','31','18'],
     'Birthday':['1998-03-02','1993-12-04','1978-11-24','1989-01-03','2002-07-02']}
df2 = pd.DataFrame(f)
df2.to_csv('users.csv',index=False)

In [9]:
i = {'id':['0','1','2','3','4','5','6','7','8'],
     'state':['California','Cali','Calefornia','Calefornie','Californie','Calfornia',
              'Calefernia','New York','New York City']}
df3 = pd.DataFrame(i)
df3.to_csv('survey.csv',index=False)

In [10]:
e = {'state':['California', 'New York']}
df4 = pd.DataFrame(e)
df4.to_csv('categories.csv',index=False)

In [2]:
a = {'rec_id':['rec-1070-org','rec-1016-org'],
     'given_name':['michaela','courtney'],
     'surname':['neumann','painter'],
     'date_of_birth':['19151111','19161214'],
     'suburb':['winston hills','richlands'],
     'state':['cal','txs'],
     'address_id':['stanley street','pinkerton circuit']}
df = pd.DataFrame(a)
df.to_csv('census_a.csv',index=False)

In [3]:
e = {'rec_id':['rec-561-dup-0','rec-2642-dup-0'],
     'given_name':['elton','mitchell'],
     'surname':['NaN','maxon'],
     'date_of_birth':['19651013','19390212'],
     'suburb':['windermere','north ryde'],
     'state':['ny','cal'],
     'address_id':['light setreet','edkins street']}
df1 = pd.DataFrame(e)
df1.to_csv('census_b.csv',index=False)